In [1]:
import pandas as pd
import mysql.connector
import numpy as np

In [2]:
df_buses_K=pd.read_csv(r"D:\guvi\redbus project\busdetails\df_buses_K.csv")
df_buses_A=pd.read_csv(r"D:\guvi\redbus project\busdetails\df_buses_AP.csv")
df_buses_T=pd.read_csv(r"D:\guvi\redbus project\busdetails\df_buses_T.csv")
df_buses_KM=pd.read_csv(r"D:\guvi\redbus project\busdetails\df_buses_KM.csv")
df_buses_R=pd.read_csv(r"D:\guvi\redbus project\busdetails\df_buses_R.csv")
df_buses_SB=pd.read_csv(r"D:\guvi\redbus project\busdetails\df_buses_SB.csv")
df_buses_H=pd.read_csv(r"D:\guvi\redbus project\busdetails\df_buses_H.csv")
df_buses_A=pd.read_csv(r"D:\guvi\redbus project\busdetails\df_buses_A.csv")
df_buses_UP=pd.read_csv(r"D:\guvi\redbus project\busdetails\df_buses_UP.csv")
df_buses_WB=pd.read_csv(r"D:\guvi\redbus project\busdetails\df_buses_WB.csv")

Final_df=pd.concat([df_buses_K,df_buses_A,df_buses_T,df_buses_KM,df_buses_R,df_buses_SB,df_buses_H,df_buses_A,df_buses_UP,df_buses_WB],ignore_index=True)

Final_df

,Bus_name,Bus_type,Start_time,End_time,Total_Duration,Price,Seats_Available,Ratings,Route_link,Route_name
0,KSRTC (Kerala) - 581,Super Express Non AC Seater Air Bus (2+2),10:00,18:40,08h 40m,INR 469,6 Seats available,4.3\n99,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
1,KSRTC (Kerala) - 52,SWIFT-GARUDA A/C SEATER BUS,12:00,20:20,08h 20m,INR 627,18 Seats available,4.0\n135,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
2,KSRTC (Kerala) - 1210,SWIFT-HYBRID NON AC SEATER CUM SLEEPER,12:55,21:05,08h 10m,INR 567,18 Seats available,3.8\n18,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
3,KSRTC (Kerala) - 1378,AC MULTI AXLE,13:46,21:25,07h 39m,INR 729,24 Seats available,2.7\n36,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
4,KSRTC (Kerala) - 129,SWIFT-GARUDA A/C SEATER BUS,14:15,23:05,08h 50m,INR 627,26 Seats available,4.1\n97,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
...,...,...,...,...,...,...,...,...,...,...
1671,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,https://www.redbus.in/bus-tickets/kolkata-to-h...,Kolkata to Haldia
1672,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,https://www.redbus.in/bus-tickets/kolkata-to-h...,Kolkata to Haldia
1673,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,https://www.redbus.in/bus-tickets/kolkata-to-h...,Kolkata to Haldia
1674,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,https://www.redbus.in/bus-tickets/kolkata-to-h...,Kolkata to Haldia
1675,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,https://www.redbus.in/bus-tickets/kolkata-to-h...,Kolkata to Haldia

Data cleaning

In [3]:
Final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1676 entries, 0 to 1675
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Bus_name         1368 non-null   object
 1   Bus_type         1346 non-null   object
 2   Start_time       1368 non-null   object
 3   End_time         1368 non-null   object
 4   Total_Duration   1369 non-null   object
 5   Price            1374 non-null   object
 6   Seats_Available  1367 non-null   object
 7   Ratings          1373 non-null   object
 8   Route_link       1676 non-null   object
 9   Route_name       1676 non-null   object
dtypes: object(10)
memory usage: 131.1+ KB

In [4]:
#convert prices to numeric

Final_df["Price"]=Final_df["Price"].str.replace("INR","")
Final_df["Price"]=Final_df["Price"].astype(float)
Final_df["Price"].fillna(0)

0       469.0
1       627.0
2       567.0
3       729.0
4       627.0
        ...
1671      0.0
1672      0.0
1673      0.0
1674      0.0
1675      0.0
Name: Price, Length: 1676, dtype: float64

In [5]:
Final_df['Ratings'] = Final_df['Ratings'].astype(str)
Final_df['Ratings'] = Final_df['Ratings'].str.replace("New", "")
Final_df['Ratings'] = Final_df['Ratings'].str.strip()
Final_df['Ratings'] = Final_df['Ratings'].str.split().str[0]
Final_df['Ratings'] = pd.to_numeric(Final_df['Ratings'], errors='coerce')
Final_df['Ratings'].fillna(0, inplace=True)

C:\Users\vicky\AppData\Local\Temp\ipykernel_22192\1289175214.py:6: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  Final_df['Ratings'].fillna(0, inplace=True)

In [6]:
#info after datatype change
Final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1676 entries, 0 to 1675
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Bus_name         1368 non-null   object
 1   Bus_type         1346 non-null   object
 2   Start_time       1368 non-null   object
 3   End_time         1368 non-null   object
 4   Total_Duration   1369 non-null   object
 5   Price            1374 non-null   float64
 6   Seats_Available  1367 non-null   object
 7   Ratings          1676 non-null   float64
 8   Route_link       1676 non-null   object
 9   Route_name       1676 non-null   object
dtypes: float64(2), object(8)
memory usage: 131.1+ KB

In [8]:
Final_df = Final_df[Final_df["Price"] <= 7000]

In [9]:
#replacig the nan value

import numpy as np

Final_df = Final_df.replace(np.nan, None)

In [10]:
#change dataframe to csv
path=r"D:\guvi\redbus project\sqlconn\Final_df.csv"
Final_df.to_csv(path,index=False)

In [36]:
pip install --upgrade mysql-connector

Requirement already satisfied: mysql-connector in c:\users\vicky\appdata\local\programs\python\python311\lib\site-packages (2.2.9)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.2.1 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [11]:
import pandas as pd
import sqlite3

# Load the CSV file into a Pandas DataFrame
df = pd.read_csv(r"D:\guvi\redbus project\sqlconn\Final_df.csv")

# Connect to an SQLite database (or create it if it doesn't exist)
conn = sqlite3.connect(r"D:\guvi\redbus project\sqlconn\redbus.db")

# Write the DataFrame to a table in the SQLite database
df.to_sql("Final_df", conn, if_exists="replace", index=False)

print("Data has been successfully written to the SQLite database.")

# Verify connection type
print(type(conn))  # Output: <class 'sqlite3.Connection'>

# Close the connection
#conn.close()

Data has been successfully written to the SQLite database.
<class 'sqlite3.Connection'>

In [12]:
cursor = conn.cursor()


type(cursor)

sqlite3.Cursor

In [13]:
# Create the table if it doesn't already exist
cursor.execute('''
CREATE TABLE IF NOT EXISTS bus_details(
    ID INT AUTO_INCREMENT PRIMARY KEY,
    Bus_name VARCHAR(255) NOT NULL,
    Bus_type VARCHAR(255) NOT NULL,
    Start_time VARCHAR(255) NOT NULL,
    End_time VARCHAR(255) NOT NULL,
    Total_duration VARCHAR(255) NOT NULL,
    Price FLOAT NOT NULL,
    Seats_Available VARCHAR(255) NULL,
    Ratings FLOAT NULL,
    Route_link VARCHAR(255) NULL,
    Route_name VARCHAR(255) NULL
)
''')

In [14]:
# Replacing NaN values with default values for NOT NULL columns
Final_df['Bus_name'] = Final_df['Bus_name'].fillna('Unknown Bus Name')
Final_df['Bus_type'] = Final_df['Bus_type'].fillna('Unknown Bus Type')
Final_df['Start_time'] = Final_df['Start_time'].fillna('00:00')
Final_df['End_time'] = Final_df['End_time'].fillna('00:00')
Final_df['Total_Duration'] = Final_df['Total_Duration'].fillna('00h 00m')
Final_df['Price'] = Final_df['Price'].fillna(0.0)  # Default price to 0.0
Final_df['Seats_Available'] = Final_df['Seats_Available'].fillna('Unknown')
Final_df['Ratings'] = Final_df['Ratings'].fillna(0.0)

In [55]:
# SQL INSERT query for SQLite
insert_query = '''
INSERT INTO bus_details(
    Bus_name,
    Bus_type,
    Start_time,
    End_time,
    Total_duration,
    Price,
    Seats_Available,
    Ratings,
    Route_link,
    Route_name
) 
VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
'''

# Convert DataFrame to a list of tuples
data = Final_df.values.tolist()

# Execute the query with executemany
cursor.executemany(insert_query, data)

# Commit the transaction
conn.commit()
print("Values inserted successfully")

Values inserted successfully

In [16]:
cursor.execute("SELECT * FROM bus_details")

results = cursor.fetchall()

# Loop through the results and print them
for row in results:
    print(row)